Repository: abdusattoryaminjonov/talabalar-amaliyoti-
Catalog: lib/languages/*.arb
Languages: uz

# appTitle
source: NPUU Internship
uz: NPUU Amaliyot

source: Login
uz: Kirish

source: Log out
uz: Chiqish

# loginInput
source: Enter login
uz: Logini kiriting

source: Password
uz: Parol

# passInput
source: Enter password
uz: Parolni kiriting

# forgotPass
source: Forgot your password?
uz: Parolni unutdingizmi?

# empty
source: The input field is empty
uz: Kirish maydoni bo'sh

source: Server error.
uz: Server xatosi.

# errorPlease
source: Error, please try again later.
uz: Xato, iltimos, keyinroq qayta urinib ko'ring.

# notStudent
source: You are not a STUDENT.
uz: Siz TALABA emassiz

# dataIsOutdated
source: User data is out of date. Please log in again.
uz: Foydalanuvchi ma'lumotlari eskirgan. Iltimos ilovaga qaytadan kiring.

# unknownError
source: Unknown error. Check the intranet, re-enter the application
uz: Nomaʼlum xatolik. Intranetni tekshiring, ilovaga qaytadan kiring

# connectionTimeout
source: Unable to connect to the Internet
uz: Internet bilan bogʻlanib bo‘lmadi

# logsAndMap
source: Attempts
uz: Urinishlar

# nowInter
source: Current Internship
uz: Joriy amaliyot

# notChoseInter
source: Select Internship to make the app work!
uz: Amaliyot tanlanmagan!

# interList
source: Internships list
uz: Amaliyotlar ro'yxati

# interCheckIn
source: Selected
uz: Tanlandi

# logOutTitle
source: Logout
uz: Tizimdan chiqish

# logOutContent
source: Are you sure you want to log out?
uz: Siz rostdan ham tizimni tark etmoqchimisiz?

# noText
source: No
uz: Yo'q

# yesText
source: Yes
uz: Ha

# notEnterTxt
source: NOT ENTERED
uz: O'TILMAGAN

# toComeText
source: COMING
uz: KELISH

# toGoText
source: GOING
uz: KETISH

# taskText
source: task
uz: topshiriq

source: View
uz: Ko'rish

# semesterKText
source: Fall semester
uz: Kuzgi semestr

# semesterBText
source: Spring semester
uz: Bahorgi semestr

# lostTimeText
source: Lost hours
uz: Yoqotilgan soat

# moreText
source: More
uz: Ko'proq

# tasksScoreText
source: Assignment score
uz: Topshiriqlar bali

# tasksText
source: Assignments
uz: Topshiriqlar

# attendancesCalender
source: Attendance Calendar
uz: Davomat kalendari

# choseDay
source: Choose Day
uz: Kun tanlang

# locationMessage
source: GPS permission permanently denied!
uz: GPS ruxsati doimiy rad etilgan!

# notData
source: No data on this day
uz: Bu kunda ma'lumot yo‘q

# lieLocation
source: Lie Location detected!
uz: Yolg‘on Lokatsiya aniqlangan!

# goOutAtt
source: Outgoing attendance
uz: Ketish davomati

# toGoAtt
source: Outgoing attendance
uz: Ketish davomati

# toComeAtt
source: Arriving attendance
uz: Kelish davomati

# logsEmpty
source: No logs for this day
uz: Bu kunda loglar yo‘q

# copyText
source: Copied
uz: Nusxalandi

source: Settings
uz: Sozlamalar

# passSuccess
source: Password updated successfully
uz: Parol muvaffaqiyatli yangilandi

# passError
source: An error occurred
uz: Xatolik yuz berdi

# passConnection
source: Network error
uz: Tarmoq xatosi

# passOld
source: Old password
uz: Eski parol

# passEnterOld
source: Enter old password
uz: Eski parolni kiriting

# passNew
source: New password
uz: Yangi parol

# passEnterNew
source: Password must be at least 6 characters
uz: Parol kamida 6 ta belgidan iborat bo‘lsin

# passCheck
source: Confirm new password
uz: Yangi parolni tasdiqlang

# passNotTrue
source: Passwords do not match
uz: Parollar mos emas

# passOk
source: Update password
uz: Parolni yangilash

# score
source: Rating
uz: Reyting

# scoreGroup
source: Group
uz: Guruh

# scoreType
source: Specialization
uz: Mutaxassislik

# sortScore
source: Sort by Score
uz: Ball bo'yicha saralash

# sortLostTime
source: Sort by Hours Left
uz: Qoldirilgan soatlar bo'yicha saralash

source: Attendance
uz: Davomat

# scoreA
source: Score
uz: Ball

# comIn
source: Incoming message
uz: Kelish xabari

# comOut
source: Outgoing message
uz: Ketish xabari

# optionalMessage
source: Write a message (optional)...
uz: Xabar yozish (ixtiyoriy)...

# cancelText
source: Cancel
uz: Bekor qilish

# submitText
source: Submit
uz: Yuborish

# submitMainIdeTxt
source: By clicking the "SUBMIT" button, the arrival/departure attendance of the internship location will be sent.
uz: "YUBORISH" tugmasini bosangiz amaliyot o'tash joyining kelish/ketish davomati jo'natiladi.

# notWorking
source: This feature is not working. It is being created.
uz: Bu funksiya ishlamaydi. Yaratish jarayonida

# pageNotTitle
source: This page is currently unavailable
uz: Bu sahifa hozirda ishlamaydi

# pageNotDes
source: Technical work is underway. Please try again later.
uz: Texnik ishlar olib borilmoqda. Iltimos, keyinroq qayta urinib ko‘ring.

# noTime
source: Lost hours not yet calculated
uz: Yoqotilgan soatlar hali hisoblanmagan

# noticeTitle
source: Important Information
uz: Muhim ma'lumot

# noticeText1
source: To use this application properly, we may request access to certain permissions. Please read the information below carefully.
uz: Ushbu ilovadan to'g'ri foydalanish uchun biz ma'lum ruxsatnomalarga kirishni so'rashimiz mumkin. Iltimos, quyidagi ma'lumotlarni diqqat bilan o'qing.

# noticeText2
source: • Location Permission
uz: • Joylashuvga ruxsat

# noticeText3
source: The application may request access to your location to provide better services and features. Your location data is used only within the application and is not shared with third parties.
uz: Ilova yaxshiroq xizmatlar va funksiyalarni taqdim etish uchun sizning joylashuvingizga kirishni so'rashi mumkin. Sizning joylashuv ma'lumotlaringiz faqat ilova ichida ishlatiladi va uchinchi tomonlar bilan ulashilmaydi.

# noticeText4
source: • Notification Permission
uz: • Bildirishnoma ruxsati

# noticeText5
source: The application may send notifications to inform you about important updates and reminders.
uz: Ilova sizni muhim yangilanishlar va eslatmalar haqida xabardor qilish uchun bildirishnomalar yuborishi mumkin.

# noticeText6
source: Privacy and Data Usage
uz: Maxfiylik va ma'lumotlardan foydalanish

# noticeText7
source: The application collects only the minimum data required for its functionality. All data is stored securely and is not sold or shared with third parties.
uz: Ilova faqat uning ishlashi uchun zarur bo'lgan minimal ma'lumotlarni to'playdi. Barcha ma'lumotlar xavfsiz saqlanadi va uchinchi tomonlar bilan sotilmaydi yoki ulashilmaydi.

# noticeGetIt
source: I Understand
uz: Tushundim

# buildingMarkerTitle
source: Internship Building
uz: Amaliyot binosi

# iTitle
source: Character Description
uz: Belgilar Ta'rifi

# iDate
source: Date
uz: Sana

# iDateDesc
source: Today's date, or selected date
uz: Bugungi sana, yoki tanlangan sana

# iPoint
source: Operation point
uz: Amaliyot nuqtasi

# iPointDesc
source: The designated point is the practice building
uz: Belgilangan nuqta amaliyot binosi

# iWrongLoc
source: Wrong location
uz: Noto'gri lakatsiya

# iWrongLocDesc
source: The point where you tried to go outside the designated area repeatedly
uz: Belgilangan hudud tashqarisidan davomatan o'tishga harakat qilingan nuqta

# iCircle
source: Boundary
uz: Chegara

# iCircleDesc
source: The boundary of the practice building
uz: Amaliyot binosining chegarasi

# iEnd
source: Please note that if no information is displayed and the google map is empty, please select the practice base on the home page!
uz: Eslatib o'tamiz agar hechqanday ma'lumot ko'rinmasa va google map bo'sh bo'lsa iltimos bosh sahifadagi amaliyot bazasini tanlan!
